In [2]:
import numpy as np
import pandas as pd
from datetime import datetime as dt

## Datime and Time Methods

In [4]:
# imput variables

my_year = 2015
my_month = 1
my_day = 1
my_hour = 2
my_min = 30
my_sec = 15

In [7]:
# create date from variables using datetime method 

my_date = dt(my_year,my_month,my_day)
my_date
# notice the python automaticly filled in the values for hour, min

datetime.datetime(2015, 1, 1, 0, 0)

In [9]:
my_date_time = dt(my_year,my_month,my_day, my_hour, my_min, my_sec)
my_date_time

datetime.datetime(2015, 1, 1, 2, 30, 15)

In [11]:
my_date_time.year

2015

In [12]:
my_ser = pd.Series(["Nov 3, 1990","2000-01-01", None])

In [14]:
my_ser

# pandas understand that this is an object 
# but does not understand that 
# this is a date object

0    Nov 3, 1990
1     2000-01-01
2           None
dtype: object

In [17]:
my_ser[0].year

# pandas will not undersand this command 
# and produce the mistake
# we will have to make it undertsnd it 
# from a string call

'Nov 3, 1990'

# pd.to_datetime

In [20]:
timeser = pd.to_datetime(my_ser)
timeser

# this method wont complain 
# it will convert the date time 
# from any format to standard one (YYYY-MM-DD)

0   1990-11-03
1   2000-01-01
2          NaT
dtype: datetime64[ns]

In [21]:
timeser[0]

Timestamp('1990-11-03 00:00:00')

In [22]:
timeser[0].year

1990

In [23]:
euro_date = "31-12-2000"

In [26]:
pd.to_datetime(euro_date)

Timestamp('2000-12-31 00:00:00')

In [27]:
euro_date_2 = "10-12-2000"

# this is tricky 
# python will confuse the date with moth in euro standards
# if day < month

In [31]:
pd.to_datetime(euro_date_2)

# python will produce a mistake here 
# it will confuse the date and month 
# to avoid it use build in parameter dayfirst

Timestamp('2000-10-12 00:00:00')

In [32]:
pd.to_datetime(euro_date_2, dayfirst=True)

# now it will return the correct result

Timestamp('2000-12-10 00:00:00')

# Custom date formating

In [33]:
style_date = "12--Dec--2000"

In [34]:
# we are able to tell pandas the date formatting

# we are able to call it on a series remember
# abriviations for date, month, year
# %d - date
# %b - month
# %Y - Full year


pd.to_datetime(style_date, format = "%d--%b--%Y")

Timestamp('2000-12-12 00:00:00')

In [35]:
custom_date = "12th of Dec 2000"

In [38]:
pd.to_datetime(custom_date)

# to_datetime will understand this format and wont complaign

Timestamp('2000-12-12 00:00:00')

# Reading CSV with time stamp

In [77]:
sales = pd.read_csv("/Users/vazgenosipov/Desktop/Python/Python Data analys/UNZIP_FOR_NOTEBOOKS_FINAL/DATA/RetailSales_BeerWineLiquor.csv")

In [43]:
sales["DATE"]

# pandas think this table it is an object
# we need to convert it

0      1992-01-01
1      1992-02-01
2      1992-03-01
3      1992-04-01
4      1992-05-01
          ...
335    2019-12-01
336    2020-01-01
337    2020-02-01
338    2020-03-01
339    2020-04-01
Name: DATE, Length: 340, dtype: object

In [44]:
sales["DATE"] = pd.to_datetime(sales["DATE"])

In [45]:
sales["DATE"]

# now it is a date time object

0     1992-01-01
1     1992-02-01
2     1992-03-01
3     1992-04-01
4     1992-05-01
         ...
335   2019-12-01
336   2020-01-01
337   2020-02-01
338   2020-03-01
339   2020-04-01
Name: DATE, Length: 340, dtype: datetime64[ns]

In [50]:
sales["DATE"][0].year

1992

In [84]:
# we are able to perform the same action 
# while opening a file
# take a look on parse_dates=[index of date column]

sales = pd.read_csv("/Users/vazgenosipov/Desktop/Python/Python Data analys/UNZIP_FOR_NOTEBOOKS_FINAL/DATA/RetailSales_BeerWineLiquor.csv", parse_dates=[0])

In [54]:
sales["DATE"]

# note the object type has changed

0     1992-01-01
1     1992-02-01
2     1992-03-01
3     1992-04-01
4     1992-05-01
         ...
335   2019-12-01
336   2020-01-01
337   2020-02-01
338   2020-03-01
339   2020-04-01
Name: DATE, Length: 340, dtype: datetime64[ns]

# GroupBy

In [85]:
sales = sales.set_index("DATE")

In [86]:
sales.head()

            MRTSSM4453USN
DATE
1992-01-01           1509
1992-02-01           1541
1992-03-01           1597
1992-04-01           1675
1992-05-01           1822

In [89]:
sales.resample(rule='A').mean()

# works like group by method for time stamp
# here we have resampled (groupby) by year

# for allies like "a" for year search for
### TIME SERIES OFFSET ALIASES

            MRTSSM4453USN
DATE
1992-12-31    1807.250000
1993-12-31    1794.833333
1994-12-31    1841.750000
1995-12-31    1833.916667
1996-12-31    1929.750000
1997-12-31    2006.750000
1998-12-31    2115.166667
1999-12-31    2206.333333
2000-12-31    2375.583333
2001-12-31    2468.416667
2002-12-31    2491.166667
2003-12-31    2539.083333
2004-12-31    2682.416667
2005-12-31    2797.250000
2006-12-31    3001.333333
2007-12-31    3177.333333
2008-12-31    3292.000000
2009-12-31    3353.750000
2010-12-31    3450.083333
2011-12-31    3532.666667
2012-12-31    3697.083333
2013-12-31    3839.666667
2014-12-31    4023.833333
2015-12-31    4212.500000
2016-12-31    4434.416667
2017-12-31    4602.666667
2018-12-31    4830.666667
2019-12-31    4972.750000
2020-12-31    4922.500000

In [90]:
sales = pd.read_csv("/Users/vazgenosipov/Desktop/Python/Python Data analys/UNZIP_FOR_NOTEBOOKS_FINAL/DATA/RetailSales_BeerWineLiquor.csv", parse_dates=[0])

In [91]:
sales.info

<bound method DataFrame.info of           DATE  MRTSSM4453USN
0   1992-01-01           1509
1   1992-02-01           1541
2   1992-03-01           1597
3   1992-04-01           1675
4   1992-05-01           1822
..         ...            ...
335 2019-12-01           6630
336 2020-01-01           4388
337 2020-02-01           4533
338 2020-03-01           5562
339 2020-04-01           5207

[340 rows x 2 columns]>

In [96]:
sales["DATE"].dt.year

0      1992
1      1992
2      1992
3      1992
4      1992
       ...
335    2019
336    2020
337    2020
338    2020
339    2020
Name: DATE, Length: 340, dtype: int64

In [97]:
sales["DATE"].dt.month

0       1
1       2
2       3
3       4
4       5
       ..
335    12
336     1
337     2
338     3
339     4
Name: DATE, Length: 340, dtype: int64

In [99]:
sales.groupby(sales["DATE"].dt.month).mean()

      MRTSSM4453USN
DATE
1       2600.310345
2       2608.862069
3       2913.827586
4       2902.206897
5       3087.607143
6       3063.535714
7       3200.107143
8       3117.142857
9       2946.750000
10      3040.178571
11      3166.714286
12      4223.821429